# GetTransform Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Instance..::..GetTransform Method
Instance Class See Also
---
Gets the transform of the instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Transform GetTransform()
```

Visual Basic
---
```text
Public Function GetTransform As Transform
```

Visual C++
---
```text
public:
Transform^ GetTransform()
```

# ### Return Value
The inherent transform.
# See Also
Instance Class
Autodesk.Revit.DB Namespace